travelight/app/Controllers/Login.php

SELECT *
FROM `customer`
WHERE `username` = 'gisellavd'
 LIMIT 1
---
    public function customer_auth()
    {
        $session = session();
        $model = new CustomerModel();
        $username= $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $data = $model->where('username', $username)->first();  //$data untuk ngambil dari databse