travelight/app/Controllers/Payment.php

SELECT *
FROM `pesanan`
WHERE `idCustomer` = '1'
---
    function index() {
        if (session()->get('logged_in') != "customer"){
            session()->setFlashdata('gagal', 'Anda belum login');
            return redirect()->to(base_url('/'));
        } else {
            $idCustomer = session()->get('idCustomer');
            $db      = \Config\Database::connect();
            $builder = $db->table('pesanan');
            // $builder->where('idCustomer ==', $idCustomer);
            $data['order'] = $builder->where('idCustomer =', $idCustomer)
                            ->get()->getResult('array');