travelight/app/Controllers/Payment.php

    function index() {
        if (session()->get('logged_in') != "customer"){
            session()->setFlashdata('gagal', 'Anda belum login');
            return redirect()->to(base_url('/'));
        } else {
            $idCustomer = session()->get('idCustomer');
            $db      = \Config\Database::connect();
            $builder = $db->table('pesanan');
            $data['order'] = $builder->where('idCustomer =', $idCustomer)
                            ->orderBy('idPesanan', 'DESC')->get()->getResult('array');
---
SELECT *
FROM `pesanan`
WHERE `pesanan`.`idPesanan` = '1'