travelight/app/Controllers/Product.php

SELECT *
FROM `hotel`
---
    public function index()
    {
        if (! session()->get('logged_in')){
            session()->setFlashdata('gagal', 'Anda belum login');
            return redirect()->to(base_url('/login/owner'));
         }
        else{
            $product = new HotelModel();
            $data['product'] = $product->findAll();

SELECT *
FROM `hotel`
WHERE `idPemilikHotel` = '1'
INSERT INTO `hotel` (`idPemilikHotel`, `namaHotel`, `lokasiHotel`, `deskripsiHotel`, `urlGambarHotel`) VALUES ('1', 'hotelkuu', 'jl anggrek', 'baguss', '')
---
    public function save_product()
    {
        helper(['form']);
        $id = session()->get('idPemilikHotel');

        $rules = [
            'name' => 'required|min_length[3]|max_length[255]',
            'location' => 'required|min_length[3]|max_length[500]',
            'desc' => 'required|min_length[3]|max_length[500]',
            'urlGambarHotel' => 'max_length[255]',
        ];

        if ($this->validate($rules)){
            $model = new HotelModel();
            $data = [
                'idPemilikHotel' => $id,
                'namaHotel' => $this->request->getVar('name'),
                'lokasiHotel' => $this->request->getVar('location'),
                'deskripsiHotel' => $this->request->getVar('desc'),
                'urlGambarHotel'     => $this->request->getVar('urlGambarHotel')
            ];
            $model->save($data);