travelight/app/Controllers/Profile.php

UPDATE `customer` SET `namaCustomer` = 'Gisella Vania Dwipayana', `noHpCustomer` = '08124738478', `emailCustomer` = 'gisellavd17@gmail.com', `alamatCustomer` = 'jl mangga', `username` = 'gisellaaaa'
WHERE `customer`.`idCustomer` IN ('1')
---
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->back();
        }
        $this->customer->update($id, [
            'namaCustomer' => $this->request->getVar('name'),
            'noHpCustomer' => $this->request->getVar('phone_num'),
            'emailCustomer' => $this->request->getVar('email'),
            'alamatCustomer' => $this->request->getVar('address'),
            'username'     => $this->request->getVar('username')
        ]);