travelight/app/Controllers/Room.php

            return redirect()->to(base_url('/rooms/edit/'.$id));
        }

        $this->room->update($id, [
            'jenisKamar' => $this->request->getVar('jenisKamar'),
            'harga' => $this->request->getVar('harga'),
            'waktuMulaiTersedia' => $this->request->getVar('waktuTersedia'),
            'waktuAkhirTersedia'     => $this->request->getVar('waktuHabis'),
            'stok'               => $this->request->getVar('stok')
        ]);
---
UPDATE `kamar` SET `jenisKamar` = 'Kamar Kapsul', `harga` = '100000', `waktuMulaiTersedia` = '2022-12-11', `waktuAkhirTersedia` = '2022-12-12T06:59', `stok` = '3'
WHERE `kamar`.`idKamar` IN ('3')