travelight/app/Controllers/VerifPayment.php

SELECT *
FROM `pesanan`
WHERE `pesanan`.`idPesanan` = '9'
UPDATE `pembayaran` SET `idPembayaran` = '1', `idPesanan` = '9', `urlGambarPembayaran` = 'https://cdn.pixabay.com/photo/2017/02/20/18/03/cat-2083492__340.jpg', `statusPembayaran` = 'verified'
WHERE `pembayaran`.`idPembayaran` IN ('1')
UPDATE `pesanan` SET `idPesanan` = '9', `idKamar` = '13', `idCustomer` = '1', `statusPesanan` = 'verified', `totalHargaPesanan` = '440000', `waktuCheckIn` = '2022-12-22 00:00:00.000000', `waktuCheckOut` = '2022-12-24 00:00:00.000000', `waktuPesanan` = '2022-12-22 08:28:13.000000', `tenggatWaktuPesanan` = '2022-12-23 08:28:13.000000'
WHERE `pesanan`.`idPesanan` IN ('9')
---
    function save_verif($id) {
        $modelPembayaran = new PaymentModel();
        $modelPesanan = new PesananModel();
        $dataPembayaran = $this->payment->find($id);
        $dataPesanan = $this->order->find($dataPembayaran['idPesanan']);
        $dataPembayaran['statusPembayaran'] = 'verified';
        $dataPesanan['statusPesanan'] = 'verified';
        $modelPembayaran->save($dataPembayaran);
        $modelPesanan->save($dataPesanan);